tagname#id
tagname.class
tagname[attribute=value]
tagname.class[attribute=value]
tagname#id[attribute=value]
tagname[attribute^='value'] : starts with
tagname[attribute$='value'] : ends with
tagname[attribute*='value'] : contains


Locating Child Elements(Direct Child):
tagname#id>tagname[attribute=value]

Locating elements inside other elements (child or sub-child):
tagname#id>tagname[attribute=value] tagname[attribute=value]

Locating nth Child:
<ul id="automation">
<li>Selenium</li>
 <li>QTP</li>
 <li>Sikuli</li>
</ul>

To locate the element with text ‘QTP’, we have to use “nth-of-type”
ul#automation li:nth-of-type(2)

Similarly, To select the last child element, i.e. ‘Sikuli’, we can use
ul#automation li:last-child